; domain
(define (domain bookseller)

    (:requirements :strips :typing)

    (:types book location drone capacity - object)

    (:predicates 
        (book-at ?b - book ?l - location)
        (drone-at ?d - drone ?l - location)
        (path ?l1 - location ?l2 - location)
        (empty ?d - drone)
        (first ?b - book ?d - drone)
        (last ?b - book ?d - drone)
        (ontop ?b1 - book ?b2 - book)
    )

    (:action loadFirst
        :parameters (?d - drone ?b - book ?l - location)
        :precondition (and (drone-at ?d ?l) (book-at ?b ?l) (empty ?d))
        :effect (and (not (empty ?d)) (first ?b ?d) (last ?b ?d) (not (book-at ?b ?l)))
    )

    (:action loadBottom
        :parameters (?d - drone ?b1 ?b2 - book ?l - location)
        :precondition (and (drone-at ?d ?l) (book-at ?b2 ?l) (last ?b1 ?d))
        :effect (and (not (last ?b1 ?d)) (not (book-at ?b ?l)) (ontop ?b1 ?b2) (last ?b2 ?d))
    )

    (:action unloadFinal
        :parameters (?d - drone ?b - book ?l - location)
        :precondition (and (drone-at ?d ?l) (first ?b ?d) (last ?b ?d))
        :effect (and (empty ?d) (book-at ?b ?l) (not (last ?b ?d)) (not (first ?b ?d)))
    )

    (:action unloadBottom
        :parameters (?d - drone ?b1 ?b2 - book ?l - location)
        :precondition (and (drone-at ?d ?l) (ontop ?b1 ?b2) (last ?b2 ?d))
        :effect (and (book-at ?b1 ?l) (not (ontop ?b1 ?b2)) (not (last ?b2 ?d)) (last ?b1 ?d))
    )

    (:action flyDrone
        :parameters (?d - drone ?l1 ?l2 - location)
        :precondition (and (drone-at ?d ?l1) (path ?l1 ?l2))
        :effect (and (drone-at ?d ?l2) (not (drone-at ?d ?l1)))
    )
)

; problem
(define (problem p1) (:domain bookseller)
(:objects 
    b1 b2 b3 b4 b5 b6 b7 - book
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    d1 d2 - drone
)

(:init
    (book-at b1 l1)
    (book-at b2 l1)
    (book-at b3 l1)
    (book-at b4 l4)
    (book-at b5 l5)
    (book-at b6 l7)
    (book-at b7 l7)
    (drone-at d1 l1)
    (drone-at d2 l7)
    (path l1 l2)
    (path l2 l3)
    (path l3 l4)
    (path l4 l5)
    (path l5 l6)
    (path l6 l7)
    (path l7 l8)
    (path l8 l9)
    (path l9 l1)
    (empty d1)
    (empty d2)
)

(:goal (and
    (book-at b1 l1)
    (book-at b2 l2)
    (book-at b3 l3)
    (book-at b4 l4)
    (book-at b5 l5)
    (book-at b6 l6)
    (book-at b7 l7)
))
)

; plan
1. (loadfirst d2 b6 l7)
   deleted: (empty d2) (book-at b6 l7)
   added: (first b6 d2) (last b6 d2)
   goals met: 4 of 7
2. (flydrone d2 l7 l8)
   deleted: (drone-at d2 l7)
   added: (drone-at d2 l8)
   goals met: 4 of 7
3. (flydrone d2 l8 l9)
   deleted: (drone-at d2 l8)
   added: (drone-at d2 l9)
   goals met: 4 of 7
4. (flydrone d2 l9 l1)
   deleted: (drone-at d2 l9)
   added: (drone-at d2 l1)
   goals met: 4 of 7
5. (loadbottom d2 b6 b3 l1)
   deleted: (last b6 d2)
   added: (ontop b6 b3) (last b3 d2)
   goals met: 4 of 7
6. (loadbottom d2 b3 b2 l1)
   deleted: (last b3 d2)
   added: (ontop b3 b2) (last b2 d2)
   goals met: 4 of 7
7. (loadbottom d2 b2 b2 l1)
   added: (ontop b2 b2)
   goals met: 4 of 7
8. (flydrone d2 l1 l2)
   deleted: (drone-at d2 l1)
   added: (drone-at d2 l2)
   goals met: 4 of 7
9. (unloadbottom d2 b2 b2 l2)
   deleted: (ontop b2 b2)
   added: (book-at b2 l2)
   goals met: 5 of 7
10. (flydrone d2 l2 l3)
   deleted: (drone-at d2 l2)
   added: (drone-at d2 l3)
   goals met: 5 of 7
11. (unloadbottom d2 b3 b2 l3)
   deleted: (ontop b3 b2) (last b2 d2)
   added: (book-at b3 l3) (last b3 d2)
   goals met: 6 of 7
12. (flydrone d2 l3 l4)
   deleted: (drone-at d2 l3)
   added: (drone-at d2 l4)
   goals met: 6 of 7
13. (flydrone d2 l4 l5)
   deleted: (drone-at d2 l4)
   added: (drone-at d2 l5)
   goals met: 6 of 7
14. (flydrone d2 l5 l6)
   deleted: (drone-at d2 l5)
   added: (drone-at d2 l6)
   goals met: 6 of 7
15. (unloadbottom d2 b6 b3 l6)
   deleted: (ontop b6 b3) (last b3 d2)
   added: (book-at b6 l6) (last b6 d2)
   goals met: 7 of 7
